CREATE DATABASE IF NOT EXISTS calendar;
USE calendar;

-- Create the "tasks" table with user_id as a foreign key
CREATE TABLE IF NOT EXISTS tasks (
    task_id INT AUTO_INCREMENT PRIMARY KEY,
    task_name VARCHAR(100),
    start_datetime DATETIME,
    end_datetime DATETIME,
    user_id INT,
    yearly_renew TINYINT(1),
    monthly_renew TINYINT(1),
    daily_renew TINYINT(1),
    FOREIGN KEY (user_id) REFERENCES users(user_id)
);

-- Insert data into the "tasks" table
-- ...

-- Create the "users" table
CREATE TABLE IF NOT EXISTS users (
    user_id INT AUTO_INCREMENT PRIMARY KEY,
    username VARCHAR(50),
    user_password VARCHAR(100)
);


INSERT INTO tasks (task_name, start_datetime, end_datetime, user_id) VALUES
('יום הולדת ליהונתן', '2024-01-14 08:00:00', '2024-01-14 09:00:00', 1),
('יום הולדת לבר', '2024-03-17 08:00:00', '2024-03-17 09:00:00', 1),
('יום הולדת לבן', '2024-04-02 08:00:00', '2024-04-02 09:00:00', 1),
('יום הולדת למעיין', '2024-04-20 08:00:00', '2024-04-20 09:00:00', 1),
('יום הולדת למקסים', '2024-04-24 08:00:00', '2024-04-24 09:00:00', 1),
('יום הולדת לאיתי בן חור', '2024-05-04 08:00:00', '2024-05-04 09:00:00', 1),
('יום הולדת למיכאל', '2024-05-11 08:00:00', '2024-05-11 09:00:00', 1),
('יום הולדת לאיתי א.', '2024-05-24 08:00:00', '2024-05-24 09:00:00', 1),
('יום הולדת לשייני', '2024-06-01 08:00:00', '2024-06-01 09:00:00', 1),
('יום הולדת לאסי', '2024-06-06 08:00:00', '2024-06-06 09:00:00', 1),
('יום הולדת לליאור', '2024-06-13 08:00:00', '2024-06-13 09:00:00', 1),
('יום הולדת לתומר א', '2024-07-20 08:00:00', '2024-07-20 09:00:00', 1),
('יום הולדת לעמית', '2024-08-12 08:00:00', '2024-08-12 09:00:00', 1),
('יום הולדת לדביר', '2024-08-15 08:00:00', '2024-08-15 09:00:00', 1),
('יום הולדת לאורי', '2024-08-22 08:00:00', '2024-08-22 09:00:00', 1),
('יום הולדת לכפיר', '2024-08-22 08:00:00', '2024-08-22 09:00:00', 1),
('יום הולדת לתומר', '2024-09-28 08:00:00', '2024-09-28 09:00:00', 1),
('יום הולדת לדניאל', '2024-11-19 08:00:00', '2024-11-19 09:00:00', 1),
('יום הולדת לסתיו', '2024-12-25 08:00:00', '2024-12-25 09:00:00', 1);
)

INSERT INTO tasks (task_name, start_datetime, end_datetime, user_id) VALUES
('ט"ו בשבט', '2024-01-25', '2024-01-25', 1),
('נקודת השוויון בחודש מרץ', '2024-03-20', '2024-03-20', 1),
('תענית אסתר', '2024-03-21', '2024-03-21', 1),
('ערב פורים', '2024-03-23', '2024-03-23', 1),
('שושן פורים', '2024-03-25', '2024-03-25', 1),
('יום העלייה', '2024-04-18', '2024-04-18', 1),
('ערב פסח', '2024-04-22', '2024-04-22', 1),
('פסח (יום 1)', '2024-04-23', '2024-04-23', 1),
('פסח (יום 2)', '2024-04-24', '2024-04-24', 1),
('פסח (יום 3)', '2024-04-25', '2024-04-25', 1),
('פסח (יום 4)', '2024-04-26', '2024-04-26', 1),
('פסח (יום 5)', '2024-04-27', '2024-04-27', 1),
('פסח (יום 6)', '2024-04-28', '2024-04-28', 1),
('פסח (יום 7)', '2024-04-29', '2024-04-29', 1),
('יום השואה', '2024-05-06', '2024-05-06', 1),
('יום הזכרון', '2024-05-13', '2024-05-13', 1),
('יום העצמאות', '2024-05-14', '2024-05-14', 1),
('ל"ג בעומר', '2024-05-26', '2024-05-26', 1),
('יום ירושלים', '2024-06-05', '2024-06-05', 1),
('ערב שבועות', '2024-06-11', '2024-06-11', 1),
('שבועות', '2024-06-12', '2024-06-12', 1),
('תחילת הקיץ', '2024-06-20', '2024-06-20', 1),
('יז בתמוז', '2024-07-23', '2024-07-23', 1),
('ערב תשעה באב', '2024-08-12', '2024-08-12', 1),
('תשעה באב', '2024-08-13', '2024-08-13', 1),
('תחילת הסתיו', '2024-09-22', '2024-09-22', 1),
('ערב ראש השנה', '2024-10-02', '2024-10-02', 1),
('ראש השנה', '2024-10-03', '2024-10-03', 1),
('ראש השנה (יום 2)', '2024-10-04', '2024-10-04', 1),
('צום גדליה', '2024-10-06', '2024-10-06', 1),
('ערב יום כיפור', '2024-10-11', '2024-10-11', 1),
('יום כיפור', '2024-10-12', '2024-10-12', 1),
('ערב סוכות', '2024-10-16', '2024-10-16', 1),
('סוכות (יום 1)', '2024-10-17', '2024-10-17', 1),
('סוכות (יום 2)', '2024-10-18', '2024-10-18', 1),
('סוכות (יום 3)', '2024-10-19', '2024-10-19', 1),
('סוכות (יום 4)', '2024-10-20', '2024-10-20', 1),
('סוכות (יום 5)', '2024-10-21', '2024-10-21', 1),
('סוכות (יום 6)', '2024-10-22', '2024-10-22', 1),
('סוכות (יום 7)', '2024-10-23', '2024-10-23', 1),
('שמיני עצרת / שמחת תורה', '2024-10-24', '2024-10-24', 1),
('יום העליה (בתי ספר)', '2024-11-08', '2024-11-08', 1),
('תחילת החורף', '2024-12-21', '2024-12-21', 1),
('חנוכה (יום 1)', '2024-12-26', '2024-12-26', 1),
('חנוכה (יום 2)', '2024-12-27', '2024-12-27', 1),
('חנוכה (יום 3)', '2024-12-28', '2024-12-28', 1),
('חנוכה (יום 4)', '2024-12-29', '2024-12-29', 1),
('חנוכה (יום 5)', '2024-12-30', '2024-12-30', 1),
('חנוכה (יום 6) / ראש חודש טבת', '2024-12-31', '2024-12-31', 1)
;

UPDATE tasks
SET yearly_renew = 1, monthly_renew = 0, daily_renew = 0
where task_name like '%הולדת%';

insert into users (username, user_password) values(
'administrator',
'qazwsx'
)

select * from tasks

alter table tasks
add column yearly_renew boolean,
add column monthly_renew boolean,
add column daily_renew boolean;



